<?php

namespace Database\Seeders;

use App\Models\City;
use Illuminate\Database\Seeder;

class CitySeeder extends Seeder
{
    public function run(): void
    {
        $cities = [
            'मुंबई','ठाणे','नवी मुंबई','कल्याण','डोंबिवली','पुणे','पिंपरी-चिंचवड',
            'नागपूर','नाशिक','औरंगाबाद (छत्रपती संभाजीनगर)','सोलापूर','कोल्हापूर',
            'अमरावती','नांदेड','सांगली','जळगाव','अकोला','लातूर','धुळे','अहमदनगर',
            'चंद्रपूर','परभणी','जालना','भिवंडी','पनवेल','वसई-विरार','उल्हासनगर',
            'सातारा','यवतमाळ','बीड','गोंदिया','बारामती','गडचिरोली','उस्मानाबाद',
            'हिंगोली','वर्धा','वाशिम','रत्नागिरी','सिंधुदुर्ग','पालघर','रायगड',
            'इचलकरंजी','मालेगाव','भुसावळ','अंबरनाथ','बदलापूर','कराड','मिरज',
            'गोरेगाव','चिपळूण','महाड','कर्जत','पंढरपूर','बार्शी','देगलूर','किनवट',
        ];

        foreach ($cities as $name) {
            City::firstOrCreate(['name' => $name]);
        }
    }
}